# Provides alternate versions of casks
tap 'homebrew/cask-versions'

# Provides access to ‘drivers’
tap 'homebrew/cask-drivers'

# Dependencies
cask 'java6'
brew 'sqlite'
cask 'xquartz'
brew 'zlib'

# Desktop
cask 'appcleaner'
cask 'authy'
cask 'cyberduck'
cask 'firefox'
cask 'gimp'
cask 'handbrake'
cask 'iterm2'
cask 'openemu'
cask 'sequel-pro'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'transmission'
cask 'vlc'
cask 'wireshark'

# Infrastructure
brew 'awscli'
brew 'borgbackup'
cask 'docker'
brew 'osxfuse'
brew 'squid'
brew 'sshfs'
brew 'terraform'
brew 'tor'
cask 'vagrant'
cask 'virtualbox'

# Shell
brew 'antigen'
brew 'bfg'
brew 'coreutils'
brew 'git'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gpg'
brew 'htop'
brew 'jq'
brew 'mtr'
brew 'nmap'
brew 'pinentry-mac'
brew 'pssh'
brew 'pwgen'
brew 'rename'
brew 'stow'
brew 'telnet'
brew 'the_silver_searcher'
brew 'watch'
brew 'wget'
brew 'zsh'

# Language managers
brew 'npm'
brew 'pyenv'
brew 'rbenv'

# Code quality
brew 'hadolint'
# FIXME: Deleted?
# cask 'jsl'
brew 'shellcheck'
brew 'write-good'
